# INSERT-

In [2]:
import pandas as pd

In [4]:
first=pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})
first

   A  B
0  1  4
1  2  5
2  3  6

In [9]:
#insert-
first.insert(1,'New_Data',first['A'])
first

   A  New_Data  C  B
0  1         1  1  4
1  2         2  2  5
2  3         3  3  6

In [11]:
#insert-
first.insert(1,'result',[10,20,30])
first

   A  result  New_Data  C  B
0  1      10         1  1  4
1  2      20         2  2  5
2  3      30         3  3  6

In [13]:
#Inserting/Copying Limited No Of Data into New Columns.

first['Copy']=first['A'][:2]
first

   A  result  New_Data  C  B  Copy
0  1      10         1  1  4   1.0
1  2      20         2  2  5   2.0
2  3      30         3  3  6   NaN

# DELETE-

In [ ]:
#DEL/POP key word is used for Delete The Rows & Cols In Pandas.

In [15]:
second=pd.DataFrame({'data1':[10,20,30,40,50],'data2':[60,70,80,90,100]})
second

   data1  data2
0     10     60
1     20     70
2     30     80
3     40     90
4     50    100

In [16]:
second.pop('data2')

0     60
1     70
2     80
3     90
4    100
Name: data2, dtype: int64

In [21]:
second

   data1
0     10
1     20
2     30
3     40
4     50

In [23]:
del second['data1']

In [24]:
second

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]